In [1]:
import pandas as pd 
import numpy as np

In [3]:
df = pd.read_csv("C:\\Users\\Satish\\Downloads\\DataSets\\Social_Network_Ads_DT.csv")

In [4]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [7]:
df = df.drop("User ID" ,axis=1)

In [9]:
df

     Gender  Age  EstimatedSalary  Purchased
0      Male   19            19000          0
1      Male   35            20000          0
2    Female   26            43000          0
3    Female   27            57000          0
4      Male   19            76000          0
..      ...  ...              ...        ...
395  Female   46            41000          1
396    Male   51            23000          1
397  Female   50            20000          1
398    Male   36            33000          0
399  Female   49            36000          1

[400 rows x 4 columns]

In [14]:
gen_encode = pd.get_dummies(df["Gender"],drop_first=True)

In [15]:
gen_encode

     Male
0       1
1       1
2       0
3       0
4       1
..    ...
395     0
396     1
397     0
398     1
399     0

[400 rows x 1 columns]

In [18]:
df1 = pd.concat([gen_encode,df],axis=1)

In [19]:
df1.head()

   Male  Gender  Age  EstimatedSalary  Purchased
0     1    Male   19            19000          0
1     1    Male   35            20000          0
2     0  Female   26            43000          0
3     0  Female   27            57000          0
4     1    Male   19            76000          0

In [21]:
df1.drop("Gender",axis=1,inplace=True)

In [23]:
df1.head()

   Male  Age  EstimatedSalary  Purchased
0     1   19            19000          0
1     1   35            20000          0
2     0   26            43000          0
3     0   27            57000          0
4     1   19            76000          0

In [24]:
X=df1.drop("Purchased",axis=1)

In [25]:
X.head()

   Male  Age  EstimatedSalary
0     1   19            19000
1     1   35            20000
2     0   26            43000
3     0   27            57000
4     1   19            76000

In [26]:
y = df1[["Purchased"]]

In [27]:
y.head()

   Purchased
0          0
1          0
2          0
3          0
4          0

In [28]:
from sklearn.model_selection import train_test_split

In [29]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.30)

In [30]:
X_train.shape

(280, 3)

In [31]:
X_test.shape

(120, 3)

In [32]:
y_train.shape

(280, 1)

In [33]:
y_test.shape

(120, 1)

In [34]:
from sklearn.tree import DecisionTreeClassifier

In [35]:
dclass = DecisionTreeClassifier()

In [36]:
dclass.fit(X_train,y_train)

DecisionTreeClassifier()

In [39]:
y_pred = dclass.predict(X_test)

In [40]:
y_pred

array([0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0,
       0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1,
       0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0,
       0, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1,
       0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0,
       0, 1, 0, 0, 0, 1, 1, 0, 1, 1], dtype=int64)

In [38]:
dclass.score(X_test,y_test)

0.8416666666666667

In [41]:
from sklearn.metrics import accuracy_score

In [42]:
accuracy_score(y_test,y_pred)

0.8416666666666667

In [43]:
from sklearn.preprocessing import StandardScaler

In [45]:
ss = StandardScaler()

In [47]:
ss.fit(X_train,y_train)

StandardScaler()

In [48]:
X_train_ss = ss.transform(X_train)

In [49]:
X_test_ss = ss.transform(X_test)

In [51]:
dtree = DecisionTreeClassifier()

In [52]:
dtree.fit(X_train_ss,y_train)

DecisionTreeClassifier()

In [53]:
dtree.score(X_test_ss,y_test)

0.8416666666666667